ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_USART.cpp
    case TinyCLR_Uart_Parity::Mark:
        USARTC.UART_LCR |= LPC24XX_USART::UART_LCR_SPE;

    case  TinyCLR_Uart_Parity::Odd:
        USARTC.UART_LCR |= LPC24XX_USART::UART_LCR_PBE;
        break;

    case TinyCLR_Uart_Parity::None:
        USARTC.UART_LCR &= ~LPC24XX_USART::UART_LCR_PBE;
        break;

    default:

        return TinyCLR_Result::NotSupported;
    }

    if (handshaking != TinyCLR_Uart_Handshake::None && controllerIndex != 1) // Only port 2 support handshaking
        return TinyCLR_Result::NotSupported;


    switch (handshaking) {
    case TinyCLR_Uart_Handshake::RequestToSend:
        USARTC.UART_MCR |= (1 << 6) | (1 << 7);
        state->handshakeEnable = true;
        break;

    case TinyCLR_Uart_Handshake::XOnXOff:
    case TinyCLR_Uart_Handshake::RequestToSendXOnXOff:
        return TinyCLR_Result::NotSupported;
    }

    // CWS: Set the RX FIFO trigger level (to 8 bytes), reset RX, TX FIFO
    USARTC.SEL3.FCR.UART_FCR = (LPC24XX_USART::UART_FCR_RFITL_08 << LPC24XX_USART::UART_FCR_RFITL_shift) |
        LPC24XX_USART::UART_FCR_TFR |
        LPC24XX_USART::UART_FCR_RFR |
        LPC24XX_USART::UART_FCR_FME;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->txBufferSize == 0) {
        state->txBufferSize = uartTxDefaultBuffersSize[controllerIndex];

        state->TxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, state->txBufferSize);

        if (state->TxBuffer == nullptr) {
            state->txBufferSize = 0;

            return TinyCLR_Result::OutOfMemory;
        }
    }

    if (state->rxBufferSize == 0) {
        state->rxBufferSize = uartRxDefaultBuffersSize[controllerIndex];

        state->RxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, state->rxBufferSize);

        if (state->RxBuffer == nullptr) {
            state->rxBufferSize = 0;

            return TinyCLR_Result::OutOfMemory;
        }
    }


    LPC24_Interrupt_Activate(LPC24XX_USART::getIntNo(controllerIndex), (uint32_t*)&LPC24_Uart_InterruptHandler, (void*)&state->controllerIndex);
    LPC24_Interrupt_Enable(LPC24XX_USART::getIntNo(controllerIndex));

    LPC24_Uart_PinConfiguration(controllerIndex, true);

    state->isOpened = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Uart_Release(const TinyCLR_Uart_Controller* self) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    if (state->intializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->intializeCount--;

    if (state->intializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        LPC24XX_USART& USARTC = LPC24XX::UART(controllerIndex);

        LPC24_Interrupt_Disable(LPC24XX_USART::getIntNo(controllerIndex));

        if (state->isOpened) {
            if (state->handshakeEnable) {
                USARTC.UART_MCR &= ~((1 << 6) | (1 << 7));
            }

            // CWS: Disable interrupts
            USARTC.UART_LCR = 0; // prepare to Init UART
            USARTC.SEL2.IER.UART_IER &= ~(LPC24XX_USART::UART_IER_INTR_ALL_SET);         // Disable all UART interrupt

            LPC24_Uart_PinConfiguration(controllerIndex, false);
        }

        state->txBufferCount = 0;
        state->txBufferIn = 0;
        state->txBufferOut = 0;

        state->rxBufferCount = 0;
        state->rxBufferIn = 0;
        state->rxBufferOut = 0;

        state->isOpened = false;
        state->handshakeEnable = false;

        switch (controllerIndex) {
        case 0:
            LPC24XX::SYSCON().PCONP &= ~PCONP_PCUART0;
            break;

        case 1:
            LPC24XX::SYSCON().PCONP &= ~PCONP_PCUART1;
            break;

        case 2:
            LPC24XX::SYSCON().PCONP &= ~PCONP_PCUART2;
            break;

        case 3:
            LPC24XX::SYSCON().PCONP &= ~PCONP_PCUART3;
            break;
        }
        if (apiManager != nullptr) {
            auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

            if (state->txBufferSize != 0) {
                memoryProvider->Free(memoryProvider, state->TxBuffer);

                state->txBufferSize = 0;
            }

            if (state->rxBufferSize != 0) {
                memoryProvider->Free(memoryProvider, state->RxBuffer);

                state->rxBufferSize = 0;
            }
        }
    }

    return TinyCLR_Result::Success;
}

void LPC24_Uart_TxBufferEmptyInterruptEnable(int controllerIndex, bool enable) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC24XX_USART& USARTC = LPC24XX::UART(controllerIndex);

    if (enable) {
        LPC24XX::VIC().ForceInterrupt(LPC24XX_USART::getIntNo(controllerIndex));// force interrupt as this chip has a bug????
        USARTC.SEL2.IER.UART_IER |= (LPC24XX_USART::UART_IER_THREIE);
    }
    else {
        USARTC.SEL2.IER.UART_IER &= ~(LPC24XX_USART::UART_IER_THREIE);
    }
}

void LPC24_Uart_RxBufferFullInterruptEnable(int controllerIndex, bool enable) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC24XX_USART& USARTC = LPC24XX::UART(controllerIndex);

    if (enable) {
        USARTC.SEL2.IER.UART_IER |= (LPC24XX_USART::UART_IER_RDAIE);
    }
    else {
        USARTC.SEL2.IER.UART_IER &= ~(LPC24XX_USART::UART_IER_RDAIE);
    }
}

bool LPC24_Uart_TxHandshakeEnabledState(int controllerIndex) {
    return true; // If this handshake input is not being used, it is assumed to be good
}

TinyCLR_Result LPC24_Uart_Flush(const TinyCLR_Uart_Controller* self) {
    auto state = reinterpret_cast<UartState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    if (state->isOpened == false)
        return TinyCLR_Result::NotAvailable;

    // Make sute interrupt is enable
    LPC24_Uart_TxBufferEmptyInterruptEnable(controllerIndex, true);

    while (state->txBufferCount > 0) {
        LPC24_Time_Delay(nullptr, 1);
    }

